{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "batch_input_shape": [
          null,
          24
        ],
        "activation": "linear",
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "trainable": true,
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null,
        "dtype": "float32",
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_1",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "seed": null,
        "rate": 0.25,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_2",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_2",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_2",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "seed": null,
        "rate": 0.25,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_3",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_3",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_3",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_3",
        "trainable": true,
        "seed": null,
        "rate": 0.25,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_4",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_4",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_4",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_4",
        "trainable": true,
        "seed": null,
        "rate": 0.25,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_5",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_5",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_5",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_5",
        "trainable": true,
        "seed": null,
        "rate": 0.25,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_6",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_6",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_6",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_6",
        "trainable": true,
        "seed": null,
        "rate": 0.25,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_7",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 500,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_7",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_7",
        "beta_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "epsilon": 0.001,
        "center": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "gamma_constraint": null,
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "axis": 1,
        "scale": true,
        "gamma_regularizer": null,
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        }
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_7",
        "trainable": true,
        "seed": null,
        "rate": 0.5,
        "noise_shape": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_8",
        "bias_constraint": null,
        "activation": "linear",
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "distribution": "uniform",
            "seed": null,
            "mode": "fan_avg"
          }
        },
        "activity_regularizer": null,
        "use_bias": true,
        "units": 2,
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "trainable": true,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_8",
        "trainable": true,
        "activation": "softmax"
      }
    }
  ],
  "backend": "tensorflow",
  "keras_version": "2.1.6"
}