{
  "config": [
    {
      "config": {
        "bias_regularizer": null,
        "bias_constraint": null,
        "padding": "same",
        "name": "conv2d_1",
        "batch_input_shape": [
          null,
          200,
          200,
          3
        ],
        "dilation_rate": [
          1,
          1
        ],
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "normal",
            "scale": 1.0,
            "mode": "fan_in",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "dtype": "float32",
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "trainable": true,
        "data_format": "channels_last",
        "use_bias": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "filters": 32
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "axis": -1,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "epsilon": 0.001,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "name": "batch_normalization_1",
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "strides": [
          3,
          3
        ],
        "trainable": true,
        "padding": "valid",
        "data_format": "channels_last",
        "name": "max_pooling2d_1",
        "pool_size": [
          3,
          3
        ]
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": {
        "rate": 0.25,
        "name": "dropout_1",
        "trainable": true,
        "noise_shape": null,
        "seed": null
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "bias_regularizer": null,
        "bias_constraint": null,
        "padding": "same",
        "name": "conv2d_2",
        "batch_input_shape": [
          null,
          200,
          200,
          3
        ],
        "dilation_rate": [
          1,
          1
        ],
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "normal",
            "scale": 1.0,
            "mode": "fan_in",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "dtype": "float32",
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "trainable": true,
        "data_format": "channels_last",
        "use_bias": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "filters": 64
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "activation_2",
        "trainable": true,
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "axis": -1,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "epsilon": 0.001,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "name": "batch_normalization_2",
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "bias_regularizer": null,
        "bias_constraint": null,
        "padding": "same",
        "name": "conv2d_3",
        "batch_input_shape": [
          null,
          200,
          200,
          3
        ],
        "dilation_rate": [
          1,
          1
        ],
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "normal",
            "scale": 1.0,
            "mode": "fan_in",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "dtype": "float32",
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "trainable": true,
        "data_format": "channels_last",
        "use_bias": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "filters": 64
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "activation_3",
        "trainable": true,
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "axis": -1,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "epsilon": 0.001,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "name": "batch_normalization_3",
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "strides": [
          2,
          2
        ],
        "trainable": true,
        "padding": "valid",
        "data_format": "channels_last",
        "name": "max_pooling2d_2",
        "pool_size": [
          2,
          2
        ]
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": {
        "rate": 0.25,
        "name": "dropout_2",
        "trainable": true,
        "noise_shape": null,
        "seed": null
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "bias_regularizer": null,
        "bias_constraint": null,
        "padding": "same",
        "name": "conv2d_4",
        "batch_input_shape": [
          null,
          200,
          200,
          3
        ],
        "dilation_rate": [
          1,
          1
        ],
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "normal",
            "scale": 1.0,
            "mode": "fan_in",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "dtype": "float32",
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "trainable": true,
        "data_format": "channels_last",
        "use_bias": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "filters": 128
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "activation_4",
        "trainable": true,
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "axis": -1,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "epsilon": 0.001,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "name": "batch_normalization_4",
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "bias_regularizer": null,
        "bias_constraint": null,
        "padding": "same",
        "name": "conv2d_5",
        "batch_input_shape": [
          null,
          200,
          200,
          3
        ],
        "dilation_rate": [
          1,
          1
        ],
        "activity_regularizer": null,
        "kernel_initializer": {
          "config": {
            "distribution": "normal",
            "scale": 1.0,
            "mode": "fan_in",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "activation": "linear",
        "dtype": "float32",
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "trainable": true,
        "data_format": "channels_last",
        "use_bias": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "filters": 128
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "name": "activation_5",
        "trainable": true,
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "axis": -1,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "epsilon": 0.001,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "name": "batch_normalization_5",
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "strides": [
          2,
          2
        ],
        "trainable": true,
        "padding": "valid",
        "data_format": "channels_last",
        "name": "max_pooling2d_3",
        "pool_size": [
          2,
          2
        ]
      },
      "class_name": "MaxPooling2D"
    },
    {
      "config": {
        "rate": 0.25,
        "name": "dropout_3",
        "trainable": true,
        "noise_shape": null,
        "seed": null
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "name": "flatten_1",
        "trainable": true,
        "data_format": "channels_last"
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "bias_regularizer": null,
        "activation": "linear",
        "activity_regularizer": null,
        "name": "dense_1",
        "kernel_initializer": {
          "config": {
            "distribution": "normal",
            "scale": 1.0,
            "mode": "fan_in",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_regularizer": null,
        "bias_constraint": null,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "trainable": true,
        "kernel_constraint": null,
        "units": 1024
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "activation_6",
        "trainable": true,
        "activation": "relu"
      },
      "class_name": "Activation"
    },
    {
      "config": {
        "axis": -1,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "beta_constraint": null,
        "gamma_regularizer": null,
        "epsilon": 0.001,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "name": "batch_normalization_6",
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "rate": 0.5,
        "name": "dropout_4",
        "trainable": true,
        "noise_shape": null,
        "seed": null
      },
      "class_name": "Dropout"
    },
    {
      "config": {
        "bias_regularizer": null,
        "activation": "linear",
        "activity_regularizer": null,
        "name": "dense_2",
        "kernel_initializer": {
          "config": {
            "distribution": "uniform",
            "scale": 1.0,
            "mode": "fan_avg",
            "seed": null
          },
          "class_name": "VarianceScaling"
        },
        "kernel_regularizer": null,
        "bias_constraint": null,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "trainable": true,
        "kernel_constraint": null,
        "units": 2
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "name": "activation_7",
        "trainable": true,
        "activation": "softmax"
      },
      "class_name": "Activation"
    }
  ],
  "backend": "tensorflow",
  "keras_version": "2.1.6",
  "class_name": "Sequential"
}